Core/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетПоУмолчанию</name>
    <comment>Банковский счет по умолчанию</comment>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиРасчетыПоДоговорам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиРасчетыПоДокументам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиРасчетыПоЗаказам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетОплатыПоСчетам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидГосударственногоОргана</name>
    <type>
      <types>EnumRef.ВидыГосударственныхОрганов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтрагента</name>
    <type>
      <types>EnumRef.ВидыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорПоУмолчанию</name>
    <comment>Договор контрагента по умолчанию</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументУдостоверяющийЛичность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИННВведенКорректно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникПривлеченияПокупателя</name>
    <type>
      <types>CatalogRef.ИсточникиПривлеченияПокупателей</types>
    </type>
  </attributes>
  <attributes>
    <name>КодГосударственногоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КППВведенКорректно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <comment>Номер телефона для поиска при вводе по строке</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновныеСведения</name>
    <comment>Используется для поиска в списке</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <comment>ОГРН для неиностранных контрагентов</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоСерияНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаАвансовПокупателя</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаАвансовПоставщику</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСПокупателем</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСПоставщиком</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <comment>ФИО физ лица</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДСПоУмолчанию</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицоПодписант</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяНеРезидентом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаАвансовПокупателяРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаАвансовПоставщикуРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСПокупателемРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСПоставщикомРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВыдачиНДФЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеТранпсортноеСедство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ПересчитатьКоличество</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.Регион</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyНерезидент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRytmpФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyОрганизацияПоУмолчанию</name>
    <comment>Организация контрагента по умолчанию</comment>
    <type>
      <types>CatalogRef.AzRyКонтрагентОрганизации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Теги</name>
    <attributes>
      <name>Тег</name>
      <type>
        <types>CatalogRef.Теги</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТранспортныеСредства</name>
    <attributes>
      <name>ТранпсортноеСедство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AzRyKYCАнкетаКлиента</name>
    <attributes>
      <name>Вопрос</name>
      <type>
        <types>EnumRef.AzRyВопросыKYCАнкетыКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответ</name>
      <type>
        <types>EnumRef.AzRyДаНет</types>
        <types>Boolean</types>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AzRyОценкаРискаКлиента</name>
    <attributes>
      <name>Вопрос</name>
      <type>
        <types>EnumRef.AzRyKYCВопросыКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответ</name>
      <type>
        <types>EnumRef.AzRyДаНет</types>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AzRyРискМатрицаКлиента</name>
    <attributes>
      <name>ФакторРиска</name>
      <type>
        <types>EnumRef.AzRyФакторыРискаКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>ВероятностьРиска</name>
      <type>
        <types>EnumRef.AzRyДаНет</types>
        <types>Boolean</types>
        <types>EnumRef.AzRyУровеньРискаКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>УровеньРиска</name>
      <type>
        <types>EnumRef.AzRyУровеньРискаКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>МитигирующиеМеры</name>
      <type>
        <types>EnumRef.AzRyМитигирующиеМерыРиска</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/Catalogs/Контрагенты/Forms/ФормаРедактированияСчетовУчета/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СчетУчетаРасчетовСПокупателем		= Параметры.СчетУчетаРасчетовСПокупателем;
	СчетУчетаАвансовПокупателя			= Параметры.СчетУчетаАвансовПокупателя;
	СчетУчетаРасчетовСПоставщиком		= Параметры.СчетУчетаРасчетовСПоставщиком;
	СчетУчетаАвансовПоставщику			= Параметры.СчетУчетаАвансовПоставщику;
	СчетУчетаРасчетовСПокупателемРегл	= Параметры.СчетУчетаРасчетовСПокупателемРегл;
	СчетУчетаАвансовПокупателяРегл		= Параметры.СчетУчетаАвансовПокупателяРегл;
	СчетУчетаРасчетовСПоставщикомРегл	= Параметры.СчетУчетаРасчетовСПоставщикомРегл;
	СчетУчетаАвансовПоставщикуРегл		= Параметры.СчетУчетаАвансовПоставщикуРегл;
	Ссылка						 		= Параметры.Ссылка;
	
	Если ОтказИзменитьСчетУчетаСПокупателем(Ссылка) Тогда
		Элементы.ЗапретРедактированияПокупатель.Видимость = Истина;
		Элементы.СчетУчетаРасчетовСПокупателем.Доступность = Ложь;
		Элементы.СчетУчетаАвансовПокупателя.Доступность = Ложь;
	КонецЕсли;
		
	Если ОтказИзменитьСчетУчетаСПоставщиком(Ссылка) Тогда
		Элементы.ЗапретРедактированияПоставщик.Видимость = Истина;
		Элементы.СчетУчетаРасчетовСПоставщиком.Доступность = Ложь;
		Элементы.СчетУчетаАвансовПоставщику.Доступность = Ложь;
	КонецЕсли;
	
	Элементы.ПоУмолчанию.Видимость = Элементы.СчетУчетаРасчетовСПокупателем.Доступность
		Или Элементы.СчетУчетаРасчетовСПоставщиком.Доступность;
		
	РегламентированныйУчетСервер.УстановитьВидимостьУпрУчета(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СчетУчетаРасчетовСПокупателемПриИзменении(Элемент)
	
	//Если НЕ ЗначениеЗаполнено(СчетУчетаРасчетовСПокупателем) Тогда
	//	СчетУчетаРасчетовСПокупателем = ПредопределенноеЗначение("ПланСчетов.Управленческий.РасчетыСПокупателями");
	//КонецЕсли;
	ОповеститьОбИзмененииСчетовРасчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаАвансовПокупателяПриИзменении(Элемент)
	
	//Если НЕ ЗначениеЗаполнено(СчетУчетаАвансовПокупателя) Тогда
	//	СчетУчетаАвансовПокупателя = ПредопределенноеЗначение("ПланСчетов.Управленческий.РасчетыПоАвансамПолученным");
	//КонецЕсли;
	ОповеститьОбИзмененииСчетовРасчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаРасчетовСПоставщикомПриИзменении(Элемент)
	
	//Если НЕ ЗначениеЗаполнено(СчетУчетаРасчетовСПоставщиком) Тогда
	//	СчетУчетаРасчетовСПоставщиком = ПредопределенноеЗначение("ПланСчетов.Управленческий.РасчетыСПоставщиками");
	//КонецЕсли;
	ОповеститьОбИзмененииСчетовРасчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаАвансовПоставщикуПриИзменении(Элемент)
	
	//Если НЕ ЗначениеЗаполнено(СчетУчетаАвансовПоставщику) Тогда
	//	СчетУчетаАвансовПоставщику = ПредопределенноеЗначение("ПланСчетов.Управленческий.РасчетыПоАвансамВыданным");
	//КонецЕсли;
	ОповеститьОбИзмененииСчетовРасчетов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоУмолчанию(Команда)
	
	Если Элементы.СчетУчетаРасчетовСПокупателем.Доступность Тогда
		СчетУчетаРасчетовСПокупателем = ПредопределенноеЗначение("ПланСчетов.Управленческий.ПустаяСсылка");
		СчетУчетаАвансовПокупателя = ПредопределенноеЗначение("ПланСчетов.Управленческий.ПустаяСсылка");
	КонецЕсли;
	
	Если Элементы.СчетУчетаРасчетовСПоставщиком.Доступность Тогда
		СчетУчетаРасчетовСПоставщиком = ПредопределенноеЗначение("ПланСчетов.Управленческий.ПустаяСсылка");
		СчетУчетаАвансовПоставщику = ПредопределенноеЗначение("ПланСчетов.Управленческий.ПустаяСсылка");
	КонецЕсли;
	
	СчетаУчета = РегламентированныйУчетСервер.ПолучитьСчетаКонтрагентаПоУмолчанию();
	ЗаполнитьЗначенияСвойств(ЭтаФорма, СчетаУчета);
	
	ОповеститьОбИзмененииСчетовРасчетов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ОтказИзменитьСчетУчетаСПокупателем(Ссылка)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РасчетыСПокупателями.Период,
	|	РасчетыСПокупателями.Регистратор,
	|	РасчетыСПокупателями.НомерСтроки,
	|	РасчетыСПокупателями.Активность,
	|	РасчетыСПокупателями.ВидДвижения,
	|	РасчетыСПокупателями.Организация,
	|	РасчетыСПокупателями.ТипРасчетов,
	|	РасчетыСПокупателями.Контрагент,
	|	РасчетыСПокупателями.Договор,
	|	РасчетыСПокупателями.Документ,
	|	РасчетыСПокупателями.Заказ,
	|	РасчетыСПокупателями.Сумма,
	|	РасчетыСПокупателями.СуммаВал,
	|	РасчетыСПокупателями.СодержаниеПроводки
	|ИЗ
	|	РегистрНакопления.РасчетыСПокупателями КАК РасчетыСПокупателями
	|ГДЕ
	|	РасчетыСПокупателями.Контрагент = &Контрагент");
	
	Запрос.УстановитьПараметр("Контрагент", ?(ЗначениеЗаполнено(Ссылка), Ссылка, Неопределено));
	
	Результат = Запрос.Выполнить();
	
	Возврат НЕ Результат.Пустой();
	
КонецФункции

&НаСервере
Функция ОтказИзменитьСчетУчетаСПоставщиком(Ссылка)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РасчетыСПоставщиками.Период,
	|	РасчетыСПоставщиками.Регистратор,
	|	РасчетыСПоставщиками.НомерСтроки,
	|	РасчетыСПоставщиками.Активность,
	|	РасчетыСПоставщиками.ВидДвижения,
	|	РасчетыСПоставщиками.Организация,
	|	РасчетыСПоставщиками.ТипРасчетов,
	|	РасчетыСПоставщиками.Контрагент,
	|	РасчетыСПоставщиками.Договор,
	|	РасчетыСПоставщиками.Документ,
	|	РасчетыСПоставщиками.Заказ,
	|	РасчетыСПоставщиками.Сумма,
	|	РасчетыСПоставщиками.СуммаВал,
	|	РасчетыСПоставщиками.СодержаниеПроводки
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПоставщиками
	|ГДЕ
	|	РасчетыСПоставщиками.Контрагент = &Контрагент");
	
	Запрос.УстановитьПараметр("Контрагент", ?(ЗначениеЗаполнено(Ссылка), Ссылка, Неопределено));
	
	Результат = Запрос.Выполнить();
	
	Возврат НЕ Результат.Пустой();
	
КонецФункции

&НаКлиенте
Процедура ОповеститьОбИзмененииСчетовРасчетов()
	
	СтруктураПараметры = Новый Структура(
		"СчетУчетаРасчетовСПокупателем, СчетУчетаАвансовПокупателя, СчетУчетаРасчетовСПоставщиком, СчетУчетаАвансовПоставщику,
		|СчетУчетаРасчетовСПокупателемРегл, СчетУчетаАвансовПокупателяРегл, СчетУчетаРасчетовСПоставщикомРегл, СчетУчетаАвансовПоставщикуРегл",
		СчетУчетаРасчетовСПокупателем, СчетУчетаАвансовПокупателя, СчетУчетаРасчетовСПоставщиком, СчетУчетаАвансовПоставщику,
		СчетУчетаРасчетовСПокупателемРегл, СчетУчетаАвансовПокупателяРегл, СчетУчетаРасчетовСПоставщикомРегл, СчетУчетаАвансовПоставщикуРегл
	);
	
	Оповестить("ИзменилисьСчетаРасчетов", СтруктураПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаАвансовПокупателяРеглПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(СчетУчетаАвансовПокупателяРегл) Тогда
		СчетУчетаАвансовПокупателяРегл = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Вспомогательный");
	КонецЕсли;
	РегламентированныйУчетСервер.УстановитьУпрСчетИзПланаСчетовХозрасчетный(СчетУчетаАвансовПокупателяРегл, СчетУчетаАвансовПокупателя);
	ОповеститьОбИзмененииСчетовРасчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаАвансовПоставщикуРеглПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(СчетУчетаАвансовПоставщикуРегл) Тогда
		СчетУчетаАвансовПоставщикуРегл = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Вспомогательный");
	КонецЕсли;
	РегламентированныйУчетСервер.УстановитьУпрСчетИзПланаСчетовХозрасчетный(СчетУчетаАвансовПоставщикуРегл, СчетУчетаАвансовПоставщику);
	ОповеститьОбИзмененииСчетовРасчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаРасчетовСПокупателемРеглПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(СчетУчетаРасчетовСПокупателемРегл) Тогда
		СчетУчетаРасчетовСПокупателемРегл = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Вспомогательный");
	КонецЕсли;
	РегламентированныйУчетСервер.УстановитьУпрСчетИзПланаСчетовХозрасчетный(СчетУчетаРасчетовСПокупателемРегл, СчетУчетаРасчетовСПокупателем);
	ОповеститьОбИзмененииСчетовРасчетов();

КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаРасчетовСПоставщикомРеглПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(СчетУчетаРасчетовСПоставщикомРегл) Тогда
		СчетУчетаРасчетовСПоставщикомРегл = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.РасчетыСПоставщиками");
	КонецЕсли;
	РегламентированныйУчетСервер.УстановитьУпрСчетИзПланаСчетовХозрасчетный(СчетУчетаРасчетовСПоставщикомРегл, СчетУчетаРасчетовСПоставщиком);
	ОповеститьОбИзмененииСчетовРасчетов();
	
КонецПроцедуры

#КонецОбласти
